## Data Manipulation in Pandas

## Importing modules

In [1]:
import pandas as pd
import numpy as np

## Adding new column

**`DataFrame.insert()`**

Syntax:
```
DataFrame.insert(loc, column, value, allow_duplicates=False)
```

In [2]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
df

   A  B
0  1  4
1  2  5
2  3  6

In [3]:
df.insert(1, 'C', [7, 8, 8], True)
df

   A  C  B
0  1  7  4
1  2  8  5
2  3  8  6

**`DataFrame.assign`**
Creates a new dataframe with a new column added to the old dataframe.

In [4]:
new_df = df.assign(d=[10, 11, 12])
new_df

   A  C  B   d
0  1  7  4  10
1  2  8  5  11
2  3  8  6  12

In [5]:
new_df = df.assign(d=df['A'] + df['B'])
new_df

   A  C  B  d
0  1  7  4  5
1  2  8  5  7
2  3  8  6  9

**using a Dictionary**

In [6]:
new_df = df.set_index('A', inplace=False)
new_df

   C  B
A
1  7  4
2  8  5
3  8  6

In [7]:
col = {1: 10, 2: 20, 3: 30}

new_df['D'] = col
new_df

   C  B   D
A
1  7  4  10
2  8  5  20
3  8  6  30

**using a List**

In [8]:
df

   A  C  B
0  1  7  4
1  2  8  5
2  3  8  6

In [9]:
values = [40, 50, 60]

df['D'] = values
df

   A  C  B   D
0  1  7  4  40
1  2  8  5  50
2  3  8  6  60

**using `DateFrame.loc()`**

In [10]:
values = [100, 200, 300]

df.loc[:, 'E'] = values
df

   A  C  B   D    E
0  1  7  4  40  100
1  2  8  5  50  200
2  3  8  6  60  300

**Adding more than one column**

In [11]:
df.columns.values

array(['A', 'C', 'B', 'D', 'E'], dtype=object)

In [12]:
new_data = {'F': [500, 600, 700], 'G': [800, 900, 1000]}

new_df = df.assign(**new_data)
new_df

   A  C  B   D    E    F     G
0  1  7  4  40  100  500   800
1  2  8  5  50  200  600   900
2  3  8  6  60  300  700  1000

## Adding rows

In [13]:
df

   A  C  B   D    E
0  1  7  4  40  100
1  2  8  5  50  200
2  3  8  6  60  300

**using `DataFrame._append()` function**

syntax:
```
DataFrame._append(other, ignore_index=False, verify_integrity=False, sort=False)
```

In [14]:
new_df = df._append({'A': 11, 'B': 22, 'C': 33, 'D': 44, 'E': 55}, ignore_index=True)
new_df

    A   C   B   D    E
0   1   7   4  40  100
1   2   8   5  50  200
2   3   8   6  60  300
3  11  33  22  44   55

**using `DataFrame.loc`**

In [15]:
new_df.loc[len(new_df)] = [111, 222, 333, 444, 555]
new_df

     A    C    B    D    E
0    1    7    4   40  100
1    2    8    5   50  200
2    3    8    6   60  300
3   11   33   22   44   55
4  111  222  333  444  555

**using `pandas.concat()`**

In [16]:
np.random.seed(0)
new_df2 = pd.DataFrame(data=np.random.randint(0, 100, (2, 5)), columns=['A', 'B', 'C', 'D', 'E'])

df = pd.concat([new_df, new_df2], ignore_index=True)
df

     A    C    B    D    E
0    1    7    4   40  100
1    2    8    5   50  200
2    3    8    6   60  300
3   11   33   22   44   55
4  111  222  333  444  555
5   44   64   47   67   67
6    9   21   83   36   87

## Deleting rows/columns

**using `drop()` method**

Syntax:
```
DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors=’raise’)
```

In [17]:
df.set_index('A', inplace=True)
df

       C    B    D    E
A
1      7    4   40  100
2      8    5   50  200
3      8    6   60  300
11    33   22   44   55
111  222  333  444  555
44    64   47   67   67
9     21   83   36   87

In [18]:
new_df = df.drop([1, 3, 11], inplace=False)
new_df

       C    B    D    E
A
2      8    5   50  200
111  222  333  444  555
44    64   47   67   67
9     21   83   36   87

In [19]:
new_df.reset_index(inplace=True)
new_df.drop(['E', 'D'], axis=1, inplace=True)
new_df

     A    C    B
0    2    8    5
1  111  222  333
2   44   64   47
3    9   21   83

## Truncate a DataFrame
syntax:
```
DataFrame.truncate(before=None, after=None, axis=None, copy=True)
```

In [20]:
dates = pd.date_range('2024-01-01', periods=10)
np.random.seed(0)
data = np.random.randint(0, 100, (10, 4))
columns = ['A', 'B', 'C', 'D']

df = pd.DataFrame(data, index=dates, columns=columns)
df

             A   B   C   D
2024-01-01  44  47  64  67
2024-01-02  67   9  83  21
2024-01-03  36  87  70  88
2024-01-04  88  12  58  65
2024-01-05  39  87  46  88
2024-01-06  81  37  25  77
2024-01-07  72   9  20  80
2024-01-08  69  79  47  64
2024-01-09  82  99  88  49
2024-01-10  29  19  19  14

**Truncate rows**

In [21]:
truncated_df = df.truncate(before='2024-01-03', after='2024-01-07', copy=True)
truncated_df

             A   B   C   D
2024-01-03  36  87  70  88
2024-01-04  88  12  58  65
2024-01-05  39  87  46  88
2024-01-06  81  37  25  77
2024-01-07  72   9  20  80

**Truncate columns**

In [22]:
truncated_columns_df = df.truncate(before='B', after='C', axis=1, copy=True)
truncated_columns_df

             B   C
2024-01-01  47  64
2024-01-02   9  83
2024-01-03  87  70
2024-01-04  12  58
2024-01-05  87  46
2024-01-06  37  25
2024-01-07   9  20
2024-01-08  79  47
2024-01-09  99  88
2024-01-10  19  19

**Truncate with numerical index**

In [23]:
np.random.seed(0)
data = np.random.randint(0, 100, (10, 4))
columns = ['A', 'B', 'C', 'D']

df = pd.DataFrame(data, columns=columns)
df

    A   B   C   D
0  44  47  64  67
1  67   9  83  21
2  36  87  70  88
3  88  12  58  65
4  39  87  46  88
5  81  37  25  77
6  72   9  20  80
7  69  79  47  64
8  82  99  88  49
9  29  19  19  14

In [24]:
truncated_df = df.truncate(before=3, after=7)
truncated_df

    A   B   C   D
3  88  12  58  65
4  39  87  46  88
5  81  37  25  77
6  72   9  20  80
7  69  79  47  64

## Truncate a Series

In [25]:
np.random.seed(0)
data = np.random.randint(0, 100, 10)

s = pd.Series(data, name='Random Values')
s

0    44
1    47
2    64
3    67
4    67
5     9
6    83
7    21
8    36
9    87
Name: Random Values, dtype: int64

In [26]:
truncated_values = s.truncate(before=3, after=7)
truncated_values.rename('Truncated Values', inplace=True)
truncated_values

3    67
4    67
5     9
6    83
7    21
Name: Truncated Values, dtype: int64

## Iteration

In [27]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Score': [85, 88, 90, 78, 92]
}

df = pd.DataFrame(data)
df

      Name  Age         City  Score
0    Alice   24     New York     85
1      Bob   27  Los Angeles     88
2  Charlie   22      Chicago     90
3    David   32      Houston     78
4      Eva   29      Phoenix     92

### Iterating over rows

**using `iterrows()`**

In [28]:
for index, rows in df.iterrows():
    # print(f'Index: {index}')
    # print(f'Rows: {rows}')
    print(f'Index: {index}\n{rows}')

Index: 0
Name        Alice
Age            24
City     New York
Score          85
Name: 0, dtype: object
Index: 1
Name             Bob
Age               27
City     Los Angeles
Score             88
Name: 1, dtype: object
Index: 2
Name     Charlie
Age           22
City     Chicago
Score         90
Name: 2, dtype: object
Index: 3
Name       David
Age           32
City     Houston
Score         78
Name: 3, dtype: object
Index: 4
Name         Eva
Age           29
City     Phoenix
Score         92
Name: 4, dtype: object

**using `itertuples()`**

In [29]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, Name='Alice', Age=24, City='New York', Score=85)
Pandas(Index=1, Name='Bob', Age=27, City='Los Angeles', Score=88)
Pandas(Index=2, Name='Charlie', Age=22, City='Chicago', Score=90)
Pandas(Index=3, Name='David', Age=32, City='Houston', Score=78)
Pandas(Index=4, Name='Eva', Age=29, City='Phoenix', Score=92)

### Iterating over Columns

In [30]:
columns = list(df)
print('columns:', columns)

for i in columns:
    print(df[i])

columns: ['Name', 'Age', 'City', 'Score']
0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object
0    24
1    27
2    22
3    32
4    29
Name: Age, dtype: int64
0       New York
1    Los Angeles
2        Chicago
3        Houston
4        Phoenix
Name: City, dtype: object
0    85
1    88
2    90
3    78
4    92
Name: Score, dtype: int64

In [31]:
columns = list(df)

for i in columns:
    print(df[i][0])

Alice
24
New York
85

## Missing Data

In [32]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [5, np.nan, np.nan, 8, 10],
    'C': [50, 60, np.nan, 100, np.nan],
    'D': [np.nan, 3.5, np.nan, 5.5, np.nan],
    'E': [6, 20, 35, 69, 77]
}

df = pd.DataFrame(data)
df

     A     B      C    D   E
0  1.0   5.0   50.0  NaN   6
1  2.0   NaN   60.0  3.5  20
2  NaN   NaN    NaN  NaN  35
3  4.0   8.0  100.0  5.5  69
4  5.0  10.0    NaN  NaN  77

### Finding Missing Data

In [33]:
df.isnull()

       A      B      C      D      E
0  False  False  False   True  False
1  False   True  False  False  False
2   True   True   True   True  False
3  False  False  False  False  False
4  False  False   True   True  False

In [34]:
df.notnull()

       A      B      C      D     E
0   True   True   True  False  True
1   True  False   True   True  True
2  False  False  False  False  True
3   True   True   True   True  True
4   True   True  False  False  True

In [35]:
df.isnull().sum()

A    1
B    2
C    2
D    3
E    0
dtype: int64

### Manipulating Missing Data

#### Dropping Missing Data

**Dropping rows with any missing values**

In [36]:
df.dropna(inplace=False)

     A    B      C    D   E
3  4.0  8.0  100.0  5.5  69

**Dropping rows with all missing values**

In [37]:
df.dropna(how='all')
# drops rows with all missing values in a row

     A     B      C    D   E
0  1.0   5.0   50.0  NaN   6
1  2.0   NaN   60.0  3.5  20
2  NaN   NaN    NaN  NaN  35
3  4.0   8.0  100.0  5.5  69
4  5.0  10.0    NaN  NaN  77

**Dropping rows with a threshold of missing values**

In [38]:
df.dropna(thresh=3)
# drops rows with at least 3 non-missing values

     A     B      C    D   E
0  1.0   5.0   50.0  NaN   6
1  2.0   NaN   60.0  3.5  20
3  4.0   8.0  100.0  5.5  69
4  5.0  10.0    NaN  NaN  77

**Dropping column with at least one missing values**

In [39]:
df.dropna(axis=1)

    E
0   6
1  20
2  35
3  69
4  77

#### Filling Missing Data

**Filling with a specific value**

In [40]:
df.fillna(0)

     A     B      C    D   E
0  1.0   5.0   50.0  0.0   6
1  2.0   0.0   60.0  3.5  20
2  0.0   0.0    0.0  0.0  35
3  4.0   8.0  100.0  5.5  69
4  5.0  10.0    0.0  0.0  77

**Filling with the mean of the column**

In [41]:
df.fillna(df.mean())

     A          B      C    D   E
0  1.0   5.000000   50.0  4.5   6
1  2.0   7.666667   60.0  3.5  20
2  3.0   7.666667   70.0  4.5  35
3  4.0   8.000000  100.0  5.5  69
4  5.0  10.000000   70.0  4.5  77

**Filling with the median of the column**

In [42]:
df.fillna(df.median())

     A     B      C    D   E
0  1.0   5.0   50.0  4.5   6
1  2.0   8.0   60.0  3.5  20
2  3.0   8.0   60.0  4.5  35
3  4.0   8.0  100.0  5.5  69
4  5.0  10.0   60.0  4.5  77

**Filling with the mode of the column**

In [43]:
df.fillna(df.mode())

     A     B      C    D   E
0  1.0   5.0   50.0  3.5   6
1  2.0   8.0   60.0  3.5  20
2  4.0  10.0  100.0  NaN  35
3  4.0   8.0  100.0  5.5  69
4  5.0  10.0    NaN  NaN  77

**Forward and Backward filling**

In [44]:
df.ffill()

     A     B      C    D   E
0  1.0   5.0   50.0  NaN   6
1  2.0   5.0   60.0  3.5  20
2  2.0   5.0   60.0  3.5  35
3  4.0   8.0  100.0  5.5  69
4  5.0  10.0  100.0  5.5  77

In [45]:
df.bfill()

     A     B      C    D   E
0  1.0   5.0   50.0  3.5   6
1  2.0   8.0   60.0  3.5  20
2  4.0   8.0  100.0  5.5  35
3  4.0   8.0  100.0  5.5  69
4  5.0  10.0    NaN  NaN  77

**using `DataFrame.interpolate()`**

In [46]:
df.interpolate(method='linear', limit_direction='forward')

     A     B      C    D   E
0  1.0   5.0   50.0  NaN   6
1  2.0   6.0   60.0  3.5  20
2  3.0   7.0   80.0  4.5  35
3  4.0   8.0  100.0  5.5  69
4  5.0  10.0  100.0  5.5  77

#### Replacing Data

In [47]:
df.replace(to_replace=np.nan, value=-1)

     A     B      C    D   E
0  1.0   5.0   50.0 -1.0   6
1  2.0  -1.0   60.0  3.5  20
2 -1.0  -1.0   -1.0 -1.0  35
3  4.0   8.0  100.0  5.5  69
4  5.0  10.0   -1.0 -1.0  77

## Sorting
using `DataFrame.sort_values()`
Syntax:
```
DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind=’quicksort’, na_position=’last’)
```

In [48]:
df = pd.read_csv('Data/nba.csv')
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Sorting by Name**

In [49]:
df.sort_values('Name', axis=0, ascending=True, inplace=False, na_position='last')

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
152,Aaron Brooks,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0
356,Aaron Gordon,Orlando Magic,0.0,PF,20.0,6-9,220.0,Arizona,4171680.0
328,Aaron Harrison,Charlotte Hornets,9.0,SG,21.0,6-6,210.0,Kentucky,525093.0
404,Adreian Payne,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0
312,Al Horford,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0
...,...,...,...,...,...,...,...,...,...
270,Xavier Munford,Memphis Grizzlies,14.0,PG,24.0,6-3,180.0,Rhode Island,NaN
402,Zach LaVine,Minnesota Timberwolves,8.0,PG,21.0,6-5,189.0,UCLA,2148360.0
271,Zach Randolph,Memphis Grizzlies,50.0,PF,34.0,6-9,260.0,Michigan State,9638555.0
237,Zaza Pachulia,Dallas Mavericks,27.0,C,32.0,6-11,275.0,NaN,5200000.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Changing position of null values**

In [50]:
df.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [51]:
df.sort_values('Salary', axis=0, ascending=True, inplace=False, na_position='first')

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
46,Elton Brand,Philadelphia 76ers,42.0,PF,37.0,6-9,254.0,Duke,NaN
171,Dahntay Jones,Cleveland Cavaliers,30.0,SG,35.0,6-6,225.0,Duke,NaN
264,Jordan Farmar,Memphis Grizzlies,4.0,PG,29.0,6-2,180.0,UCLA,NaN
269,Ray McCallum,Memphis Grizzlies,5.0,PG,24.0,6-3,190.0,Detroit,NaN
...,...,...,...,...,...,...,...,...,...
339,Chris Bosh,Miami Heat,1.0,PF,32.0,6-11,235.0,Georgia Tech,22192730.0
251,Dwight Howard,Houston Rockets,12.0,C,30.0,6-11,265.0,NaN,22359364.0
33,Carmelo Anthony,New York Knicks,7.0,SF,32.0,6-8,240.0,Syracuse,22875000.0
169,LeBron James,Cleveland Cavaliers,23.0,SF,31.0,6-8,250.0,NaN,22970500.0
109,Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000.0

**Sorting by Team and then by Names**

In [52]:
df.sort_values(['Team', 'Name'], axis=0, ascending=True, inplace=False)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
312,Al Horford,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0
318,Dennis Schroder,Atlanta Hawks,17.0,PG,22.0,6-1,172.0,NaN,1763400.0
323,Jeff Teague,Atlanta Hawks,0.0,PG,27.0,6-2,186.0,Wake Forest,8000000.0
309,Kent Bazemore,Atlanta Hawks,24.0,SF,26.0,6-5,201.0,Old Dominion,2000000.0
311,Kirk Hinrich,Atlanta Hawks,12.0,SG,35.0,6-4,190.0,Kansas,2854940.0
...,...,...,...,...,...,...,...,...,...
376,Markieff Morris,Washington Wizards,5.0,PF,26.0,6-10,245.0,Kansas,8000000.0
375,Nene Hilario,Washington Wizards,42.0,C,33.0,6-11,250.0,NaN,13000000.0
378,Otto Porter Jr.,Washington Wizards,22.0,SF,23.0,6-8,198.0,Georgetown,4662960.0
379,Ramon Sessions,Washington Wizards,7.0,PG,30.0,6-3,190.0,Nevada,2170465.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [53]:
df.sort_values(['Team', 'Name'], axis=0, ascending=[True, False], inplace=False)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
322,Walter Tavares,Atlanta Hawks,22.0,C,24.0,7-3,260.0,NaN,1000000.0
310,Tim Hardaway Jr.,Atlanta Hawks,10.0,SG,24.0,6-6,205.0,Michigan,1304520.0
321,Tiago Splitter,Atlanta Hawks,11.0,C,31.0,6-11,245.0,NaN,9756250.0
320,Thabo Sefolosha,Atlanta Hawks,25.0,SF,32.0,6-7,220.0,NaN,4000000.0
315,Paul Millsap,Atlanta Hawks,4.0,PF,31.0,6-8,246.0,Louisiana Tech,18671659.0
...,...,...,...,...,...,...,...,...,...
380,Garrett Temple,Washington Wizards,17.0,SG,30.0,6-6,195.0,LSU,1100602.0
372,Drew Gooden,Washington Wizards,90.0,PF,34.0,6-10,250.0,Kansas,3300000.0
369,Bradley Beal,Washington Wizards,3.0,SG,22.0,6-5,207.0,Florida,5694674.0
368,Alan Anderson,Washington Wizards,6.0,SG,33.0,6-6,220.0,Michigan State,4000000.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Sorting using three Columns**

In [54]:
df.sort_values(['Team', 'Age', 'Height'], axis=0, ascending=[False, True, False])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
377,Kelly Oubre Jr.,Washington Wizards,12.0,SF,20.0,6-7,205.0,Kansas,1920240.0
369,Bradley Beal,Washington Wizards,3.0,SG,22.0,6-5,207.0,Florida,5694674.0
378,Otto Porter Jr.,Washington Wizards,22.0,SF,23.0,6-8,198.0,Georgetown,4662960.0
371,Jarell Eddie,Washington Wizards,8.0,SG,24.0,6-7,218.0,Virginia Tech,561716.0
382,John Wall,Washington Wizards,2.0,PG,25.0,6-4,195.0,Kentucky,15851950.0
...,...,...,...,...,...,...,...,...,...
321,Tiago Splitter,Atlanta Hawks,11.0,C,31.0,6-11,245.0,NaN,9756250.0
320,Thabo Sefolosha,Atlanta Hawks,25.0,SF,32.0,6-7,220.0,NaN,4000000.0
314,Kyle Korver,Atlanta Hawks,26.0,SG,35.0,6-7,212.0,Creighton,5746479.0
311,Kirk Hinrich,Atlanta Hawks,12.0,SG,35.0,6-4,190.0,Kansas,2854940.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN